#card

#=====================================================================
class Card
  attr_reader :cards

  #===================================================================== 
  def initialize 
    #トランプの各カードを配列
    @cards=[]
    #カードの種類
    marks=["♦","♠","♥","🍀"]
    numbers=["1","2","3","4","5","6","7","8","9","10","11","12","13"]
    
    #ループでカードを作成する
    marks.each do |mark|
      numbers.each do |number|
        @cards << mark+number
      end
    end
  end
  #=====================================================================

    #===================================================================== 
    def Draw(numbers)
      

    end
    #=====================================================================
end


cards=Card.new
cards.cards.each do |card|
  puts card
end  
